# Используйте официальный образ Node.js в качестве базового образа
FROM node:latest

# Установите рабочую директорию в контейнере
WORKDIR /app

# Скопируйте package.json и package-lock.json в контейнер
COPY package*.json ./

# Установите зависимости
RUN npm install

# Скопируйте все файлы вашего приложения в контейнер
COPY . .

# Соберите приложение
RUN npm run build

# Установите глобально serve для запуска статического сервера
RUN npm install -g serve

# Указать команду, которая будет запускаться при старте контейнера
CMD ["serve", "-s", "build", "-l", "3000"]